# More Data Preprocessing (with Pandas)

Pandas is a very useful data analytics package within Python.

Let's start with some random data.

In [4]:
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df

        one       two     three
a -2.176298 -0.126447 -0.035140
c -0.739974  1.044544  0.465735
e  0.655395  0.775401 -1.368235
f -0.756040  0.077196  0.365124
h -0.123105 -1.181462  0.210237

We know with Pandas we can mix & match data types, so let us add two more columns, named 'four' and 'five':

In [10]:
df['four'] = 'bar'
df['five'] = df['one'] > 0
df

        one       two     three four   five
a -2.176298 -0.126447 -0.035140  bar  False
c -0.739974  1.044544  0.465735  bar  False
e  0.655395  0.775401 -1.368235  bar   True
f -0.756040  0.077196  0.365124  bar  False
h -0.123105 -1.181462  0.210237  bar  False

Adding new rows is also simple. Below we include three extra empty rows:

In [14]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

# Your Turn Here

Do you still remember how to index a row/column?

In [15]:
#### index row 'c' below
df2.loc['c']

one     -0.739974
two       1.04454
three    0.465735
four          bar
five        False
Name: c, dtype: object

In [16]:
#### index column 'two' below
df2.two

a   -0.126447
b         NaN
c    1.044544
d         NaN
e    0.775401
f    0.077196
g         NaN
h   -1.181462
Name: two, dtype: float64

pandas has two functions isnull() and notnull() that return boolean objects when called.

In [17]:
pd.isnull(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [18]:
pd.notnull(df2['one'])

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

Missing values propagate naturally through arithmetic operations between pandas objects.

In [22]:
a = df[['one','two']]
a['one']['a':'e'] = float('nan')
a

/opt/tljh/user/lib/python3.6/site-packages/pandas/core/series.py:935: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._set_with(key, value)
/opt/tljh/user/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2963: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  exec(code_obj, self.user_global_ns, self.user_ns)

        one       two
a       NaN -0.126447
c       NaN  1.044544
e       NaN  0.775401
f -0.756040  0.077196
h -0.123105 -1.181462

In [23]:
b = df[['one','two','three']]
b

        one       two     three
a -2.176298 -0.126447 -0.035140
c -0.739974  1.044544  0.465735
e  0.655395  0.775401 -1.368235
f -0.756040  0.077196  0.365124
h -0.123105 -1.181462  0.210237

In [24]:
a + b

        one  three       two
a       NaN    NaN -0.252894
c       NaN    NaN  2.089089
e       NaN    NaN  1.550803
f -1.512080    NaN  0.154391
h -0.246209    NaN -2.362924

# How to deal with Missing Values

## Deleting Missing Values

The simplest method is always dropping all missing values - but it is highly **discouraged!!!**

In [25]:
a['one'].dropna()

f   -0.756040
h   -0.123105
Name: one, dtype: float64

By default, dropna() will drop any row containing **NaN** values, but you can change that by using the *axis=* and *thresh=* arguments.

**NOTE**: Dropping rows or columns have different uses.

In [26]:
#### This statement drop any column with NaN values
a.dropna(axis=1)

        two
a -0.126447
c  1.044544
e  0.775401
f  0.077196
h -1.181462

In [27]:
#### thresh determines how many non-NaN values a column/row should have without being dropped
c = a + b
c.dropna(axis=1, thresh=2)

        one       two
a       NaN -0.252894
c       NaN  2.089089
e       NaN  1.550803
f -1.512080  0.154391
h -0.246209 -2.362924

You can also use the *how=* argument to determine how do you want to remove the NaN values.

In [28]:
#### By default, dropna() drops column/row with any NaN values
#### how = 'all' changes that to dropping column/row with all NaN values
c.dropna(axis=1, how='all')

        one       two
a       NaN -0.252894
c       NaN  2.089089
e       NaN  1.550803
f -1.512080  0.154391
h -0.246209 -2.362924

You can refer to the [pandas.dropna() docs](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html) for more information.

## Imputing Missing Values

Imputing means filling missing values - you can do that when the missing and non-missing values are in some type of relationship.

In [29]:
my_series = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
my_series

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [30]:
#### you can fill missing values with a specific value (0)
my_series.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

Alternatively, we can specify a forward-fill to propagate the previous value forward:

In [31]:
# forward-fill
my_series.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [32]:
my_series.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

## Your Turn Here
Aforementioned method can be applied to dataframes.

In [33]:
#### Let us generate a random dataframe
rand_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['one', 'two', 'three'])
rand_df = rand_df.mask(np.random.random(rand_df.shape) < .3)
rand_df

        one       two     three
a       NaN -2.010196       NaN
b       NaN -0.927895  1.872444
c       NaN -0.072065       NaN
d  0.751574  0.452062  0.022293
e       NaN       NaN -1.202792

Your tasks are as follows:

- fill missing values in column **one** with value 1;
- fill missing values in column **two** with forward-filling;
- fill missing values in column **three** with backward-filling.

In [34]:
#### insert your code here

A useful approach for imputing your missing data is to use mean/mode to replace missing data - the reason behind this logic is that if we are going to *guess* the values of the missing data, the highest chance would be guessing it to be the mean/mode if the data follows **normal** distribution.

In [ ]:
#### let us generate another DF
my_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['A', 'B', 'C'])
my_df = my_df.mask(np.random.random(my_df.shape) < .3)
my_df

In [ ]:
#### Let us check if there is any missing value in the df
my_df.isnull().values.any()

In [ ]:
#### Then we are getting the mean of the DF
#### Note that since we only 
my_df.mean()

In [ ]:
df_filled = my_df.fillna(my_df.mean())
df_filled

In [ ]:
#### Now let us check again if there is any missing values
df_filled.isnull().values.any()

More info regarding how to handle missing data can be found [here](https://machinelearningmastery.com/handle-missing-data-python/).

# Other Tasks in Data Preprocessing

- Handling categorical data (coding)
- Handling imbalanced data
- feature engineering

These topics will be covered in later part of this class.